# -*- coding: UTF-8 -*-
"""zk naive bayes command line interface."""
from __future__ import absolute_import, unicode_literals
import sys
import os
_get_module_path = os.path.normpath(os.path.join(os.getcwd(),os.path.dirname(__file__), ''))
sys.path.append(_get_module_path + "/../zk_pycore")

from classes.zk_common import zk_common
from argparse import ArgumentParser
from _compat import *

from classes.zk_articles import zk_articles
from classes.zk_naive_bayes import zk_naive_bayes
from classes.zk_my_corpus import zk_my_corpus
from classes.zk_files import zk_files
import numpy as np
from classes.zk_conf import *
import redis,hashlib

parser = ArgumentParser(usage="%s [options] [args]" % sys.executable, description="zk naive bayes command line interface.", epilog="If no filename specified, use STDIN instead.")
parser.add_argument("-t", "--train", action="store_true", help="train model", default=False)
parser.add_argument("-r", "--model2redis", action="store_true", help="model data to redis", default=False)
parser.add_argument("-p", "--predict", action="store_true", help="predict classify", default=False)

args = parser.parse_args()

model_path   = _get_module_path + '/model/zk_bayes_model.txt'

# 预测分类
if args.predict:

    params = {'host':'192.168.101.5', 'port': 6379}
    zk_redis = redis.Redis(**params)

    nbs = zk_naive_bayes()
    # 仲辉的标签
    tags = [['苏志燮', '林中', '综艺节目', '男神', '朴信惠', '收视率', '三时三餐', '向往的生活', '中餐厅', '偶像练习生', '两天一夜', '活法', '降临'], ['视觉中国', '阿富汗', '喀布尔', '摄影师', '罗斯', '利比亚', '反对派武装', '克里斯', '法新社', '利比里亚', '战地', '德国', '美国', '法国', '政府军', '莱茵', '身亡', '伊拉克', '美军', '西班牙', '炸弹袭击', '法国海军', '悍马', '虎式坦克', '突击行动', '塔利班', '越南战争', '阿尔巴尼亚', '塞尔维亚', '遇难', '世界大战', '火箭弹', '詹姆斯', '迫击炮', '二战', '解放军', '匈牙利', '南非', '炸弹', '自杀', '越南', '荷兰', '纽约', '罗马', '意大利'], ['白血病', '康康', '心肌梗塞', '摄影师', '哮喘', '宝鸡', '发烧', '贫血', '医生'], ['女主播', '赌博', '男主播', '微信', 'qq', '社交平台', '二维码', '轰炸机', '举报', '深圳', '人民'], ['日本', '嫌疑人', '环球网', '丰田', '东京'], ['google', 'godaddy', '谷歌'], ['景甜', 'alexander wang', 'angelababy', '宋智孝', '写真', '音乐'], ['房屋所有权', '中国房地产', '房屋产权', '海景', '不动产', '审判', '房贷', '山东', '房地产'], ['小偷', '海口'], ['撒狗粮', '怦然心动', '日本'], ['人民', '网易娱乐', '索赔', '官司', '韩国', '音乐', '台湾'], ['突击步枪', '霰弹枪', '冲锋枪', '步枪', '手榴弹', '绝地求生', 'm16', '手枪', '吊顶', '战斗', 'uzi', 'mini', '肌肉车', '室内装修', '皮卡', '轻机枪', '瞄准镜', '马路', '面包'], ['任天堂', 'switch', '日本经济新闻', '东南亚'], ['雷军', '仙桃', '小米', '杨威', '求伯君', '小米之家', '湖北', '周鸿祎', '总裁', '武汉', '巴塞罗那', '中关村', '微软', '三星', '传奇', '马化腾', 'ipo', 'ar', '毒霸', '吴亦凡', '小米手机', '北京奥运会', '伦敦奥运会', '里约奥运会', '刘强东', '高通', '奥运冠军', '桑塔纳', '携程', '雷锋', '千里马', '出货量', '人民', '清明节', '端午节', '港交所', '腾讯', '百度', '网易', '省委书记', '奥运会', '过年', '步枪', '供应商', '奇迹', '基因', '董事长', '总经理', '传说', '俄罗斯', '香港', '印度', '北京'], ['发动机', '辛烷值', '火花塞', '女神', '大姚', '宝马x5', '标定', '爆震', '格越', 'ecu', '燃油标号', '压缩比', '活塞'], ['华为', '中兴通讯', 'ceo', '美国', 'at&t', '供应商', '智能手机', '运营商', '美国政府', '阿尔卡特', '国家安全', 'verizon', 'tcl', '中兴手机', '网络设备', '五角大楼', '出货量', '思科', '摩托罗拉', '军事基地', '供应链', '中国电信', '美国市场', '白宫', '美国商务部', '空白', '联想'], ['网易', '丁磊', '腾讯', 'bat', '网易云音乐', '音乐', '美团', '今日头条', '移动互联网', '饭否', '区块链', '老司机', '梦幻西游', 'app store', '京东', '教父', '中产阶级', '步步', '大话西游', '阴阳师', '王兴', '万网', '刘强东', '张一鸣', '游戏直播', 'vr', '长焦', '换了人间', 'iphone', '短视频', '网易云', '中产家庭', '网易严选', '消费升级', '共享经济', '戈尔巴乔夫', '百团大战', '滴滴', '马云', '百度', '哈佛大学', '离职', '淘宝', '阿里', '纳斯达克', '实习生', '宁波', '广州', '人民'], ['区块链', 'it之家', 'a股'], ['nvidia', 'ai', 'intel', 'gpu', 'iphone', 'ipad', 'ibm', 'amd', 'google', 'arm', '中国企业', '联发科', '华为', '英特尔', '人工智能', '投资'], ['lg', '三星', '刘海屏', '广角', 'thinq', '三星galaxy', '全面屏', 'flex', 'iphone x', '骁龙', '骁龙845', '小米mix 2s', '中国市场', '华为', '分辨率', '步步', '谷歌', '韩国'], ['出货量', 'iphone x', '红米5a', '小米', 'iphone', 'iphone 8', 'iphone 8 plus', 'iphone 7', '小米手机', '三星galaxy', '苹果手机', '智能手机', '三星'], ['高通', '展讯', '智能手机', '联发科', '英特尔', '骁龙660', '骁龙835', '骁龙845', 'qq', '微信', '浮出水面', '中国大唐', '紫光展锐', '热火', '紫光', '合资企业', '华尔街日报', '分辨率', '联通', '运营商'], ['白露', '杭州', '网红', '天天直播', '双胞胎', '淘宝', '广州'], ['蚂蚁金服', '阿里', 'ipo', '马云', '人民', '联合创始人', '移动支付', '融资', '淡马锡', '彭博', '支付宝', '阿里巴巴', '知识产权', '泰国', '外资', '印度', '投资者', '基金'], ['海尔', '纤维'], ['安卓手机', '骁龙835', '鲁大师', 'android', '小米mix2s', '骁龙845', 'miui', '一加', 'oppo', 'htc u1', '三星s9', '诺基亚7', '华为手机', '谷歌'], ['miui', '安卓手机', '华为手机', '小米手机', '华为p20', '小米mix 2s', '小米', '荣耀'], ['视觉中国', '考研', '北京大学', '高考', '华中科技大学', '广东工业大学', '托福', '教育部', '研究生', '李萍', '资格考试', '面试官', '鄙视链', '杭州师范大学', 'facebook', '注册会计师', '技术面', '罗永浩', '俞敏洪', '空姐', '深圳', '资格证书', '新东方', '幸运儿', '厦门大学', '上海交通大学', '优胜', '福布斯', '中山大学', '马云', '写字楼', '贵阳', '邯郸', '苏宁', '官司', '国资委', '安徽', '重庆', '杭州', '河北', '郑州', '上市公司', '美国'], ['扬州', '举报', '前男友', '市纪委', '出轨', '南京', '公寓', '信用卡', '房产', '白天', '社交网络', '秀恩爱', '甄嬛传', '世纪佳缘', '监察委', '微信公众号', '网红', '门当户对', '抑郁症', '胜利者', '相亲', '豪宅', '宝马', '奔驰', '过年', '公安局', '档案', '国资委', '广西', '医生', '北京'], ['阿里', '阿里巴巴', '支付宝', '投资', '陌陌', 'ipo', '核心业务', '饿了么', '蔡崇信', '腾讯', '投资人', '东南亚', '超越', '收盘', '人民', '投资者'], ['朋友圈', '流浪汉', '网红', '快门', '摄影师', '相亲', '地中海'], ['吴文俊', '央视新闻', '搜狐视频', '小长假', '市公安局', '央视', '贵州'], ['汉堡', '美国', '河南', '淘宝'], ['白百何', '陈羽凡', '秀恩爱', '出轨', '肌肉男', '绯闻男友', '泰国'], ['蔡英文', '民进党', '赖清德', '中考', '破产', '台湾'], ['幼儿园', '白杨', '杨树', '徐州', '跳舞', '身亡', '人民'], ['民政部', '武安', '举报', '公安部', '捐款', '慈善', '房产', '市公安局', '路虎', '迈腾', '光伏发电', '扫黑除恶专项斗争', '拐卖儿童', '党员干部', '殴打', '过敏', '教育局', '房租', '邯郸', '教育部', '体检', '奔驰', '档案', '审判', '书记', '四川', '人民', '北京'], ['腾讯', '小米', 'ipo', '雷军', 'zaker', '港交所', 'qq', '玛莎拉蒂', '罗永浩', '马化腾', '微信', 'ios', 'windows', 'ceo', '黄章', 'android', '神评论', '香港', '支付宝', '三星', '破产', '美国', '投资'], ['蜘蛛侠', '湖北大学', '先锋', '湖北', '香港'], ['张檬', '范世琦', '刘雨欣', '贾青', '富二代', '女明星', '出轨', '娱乐圈', '古装剧', '朋友圈', '夏家三千金', '美人心计', '王语嫣', '古剑奇谭', '如果爱', '秀恩爱', '玻尿酸', '网红', '天龙八部', '耿直', '征服'], ['高考', '河北', '衡水市', '衡水'], ['沃尔玛', '安全隐患', '投资', '沈阳', '韩国'], ['高速公路', '美国', '旧金山', '美国人', 'orange', 'emba', 'ai', 'live', '林荫大道', '高通', '洛杉矶', '公寓', '华盛顿', '污染', '地震', '博物馆', '纽约', '建成'], ['中国人', '中国市场', '意大利', 'bally', '天猫', '投资', '奥地利', '时装周', '凯特王妃', '微信公众号', 'ceo', '创意总监', 'tom', 'aqua', '私募基金', '刘雯', '奚梦瑶', '中国制造', 'gucci', '王菲', '人民', '央视春晚', '斯洛文尼亚', '克罗地亚', '阿姆斯特丹', '华尔街日报', '离职', '化妆品', '维也纳', '传奇', '以色列', '荷兰', '希腊', '亏损', '南京', '山东', '香港', '德国', '股东', '英国', '上海', '美国'], ['日本', '写真', '美少女', '网红脸', '非物质文化遗产', '美国人', '佐佐木希', '富二代', '拯救地球', '复仇者联盟', '吃鸡', '豆瓣', '出轨', '摄影师', '歌手', '脱颖而出', '女王', '演员', '传说'], ['出轨', '有希望的男人', '老男人', '导演'], ['马云', '特拉维夫', '阿里巴巴', '创始人', '女大学生', '阿里', '以色列', '中小企业', '问道'], ['潘粤明', '白夜追凶'], ['杭州网', '阿里巴巴', '阿里', '派出所', '郭靖', '人民的名义', '造谣', '检察院', '离职'], ['旅行青蛙', '淘宝', '微信公众号', '小程序', '三叶草', '孔明灯', '阿里游戏', '中国风', '中国特产', '二维码', '古建筑', '长城', '江南'], ['朋友圈', '大润发', '市公安局', '上海', '微信', '马龙', '报警'], ['万达', '陈佳', '安全隐患', '郑州'], ['cube', 'mac', '墨尔本', '波兰', '澳大利亚'], ['李健', '中将', '诈骗罪', '国安', '报警', '导演', '陆军'], ['蔡英文', '台湾', '九二共识', '民进党', '马英九', '国台办', '台北', '海外网', '大嘴巴', '联合国'], ['美国', '特朗普', '台湾', '白宫', '中国人', '美国驻华大使馆', '美国人', '美国政府', '澳门', '中国共产党', '美联航', '新闻发布会', '中美贸易', '中美贸易摩擦', 'gdp', '香港', '焦虑症', '民航局', '华为', '怒不可遏', '美国国会', '洛杉矶', '古巴', '航空母舰', '解放战争', '中兴', '解放军', '伊朗', '长城', '朝鲜', '中华人民共和国'], ['男主播', '南京', '北京', '报警', '民事行为能力', '山东', '派出所', '微信', '提现', '鼓楼', '跳舞', '江苏'], ['联发科', '中兴', '中兴通讯', '美国商务部', '台湾', '辟谣', '美国政府', '美国'], ['李佳航', '李晟', '爱情公寓', '张伟', '新还珠格格', '三八节', '微信', '秀恩爱', '基因'], ['google', 'ai', 'assistant', 'android', '输入法', '凯撒沙拉', 'waymo', '亚马逊', '无人驾驶', '人工智能', '歌手', 'sun', 'youtube', '爱范儿', 'alexa', 'siri', '机器学习', 'ces', '智能穿戴', 'wear os', 'ar', 'vr', '一加', 'tcl', '无人驾驶汽车', 'ceo', '黑科技', '华硕', '智能手机', '奶酪', '小米', '汉堡', '传感器', '印度'], ['奥林巴斯', '深圳', '卡西欧', '尼康', '智能手机', '越南', '日本'], ['商务车', '路虎', '别克', '殴打', '延安路', '治安管理', '行政拘留', '交通安全', '黄埔', '车险', '魔鬼', '高速公路', '西藏'], ['朝鲜', '金正恩', '半岛无核化', '习近平', '总书记', '党中央', '长治', '核试验', '社会主义', '杨洁篪', '半岛局势', '任和', '洲际弹道导弹', '金英哲', '金与正', '李勇', '无核化', '人民', '国务委员会', '国务委员', '王毅', '三中全会', '中共中央政治局', '外交部', '交通事故', '一战', '大连', '中共中央', '北京'], ['越南', '殴打'], ['张倩', '香港', '反对派', '钟发', '国家安全', '环球时报', '新加坡', '加拿大', '中华人民共和国', '人民'], ['吴小晖', '安邦', '集资诈骗', '安邦集团', '人民', '保监会', '上海', '董事长', '投资', '李彬', '还本付息', '央视', '房产', '总经理', '融资'], ['冰淇淋', '人道主义', '医生', '闺蜜', '于正', '上海'], ['区块链', 'facebook', 'ceo', '亚马逊', '合伙人', '纽约', '36氪', '移动互联网', 'ibm', '用户隐私', '大都会', '沃尔玛', '隐私', '微软', '谷歌', '专利', '供应商', '盈利'], ['滴滴', '空姐', '郑州', '滴滴司机', '顺风车', '方正', '郑州市'], ['微信公众号', '微信', '净利润', '腾讯', '云100', '社交平台', '上市公司', '投资', '控股股东', '移动互联网', '宋清辉', 'a股', '张超', '陈晓', '网络游戏', '星座', '超越', '董事会'], ['移动互联网', '阿里巴巴', '创业邦', '快手', '大数据', '技术总监', '去中心化', '融资', '出货量', '智能手机', '百度', '离职', '全球化', '阿里', '总经理', '投资'], ['区块链', '交易所', '韩国', 'iphone x', 'ipad', 'iwatch', '以太坊', '创业邦', '首尔', '央视', '创始人', '深圳', '投资者'], ['创业邦', '二线城市', '渠道网', '电动车', '本田', '北极光', '限购', 'c轮融资', '金融科技', 'a轮融资', 'b轮融资', '供应链金融', '马累', '融资', '渗透率', '供应商', '投资', '产业链', '新能源', '基金'], ['朋友圈', '今日头条', '微信', '区块链', 'fred', 'facebook', '质量问题', 'ai', '维基百科', '微信公众号', 'wat', '来一', '抖音', '社交网络', 'coinbase', '联合创始人', '社交关系链', '豆瓣'], ['顺风车', '滴滴', '嫌疑人', '人脸识别', '顺风车业务', '性骚扰', '郑州'], ['身份证'], ['去哪儿网', '重庆', '南岸区', '澳门', '春节', '人民'], ['成都', '川航', '萨利机长', '安全带', '轮胎', '双流机场', '刘伟', '体检', '哈尔滨', '奇迹'], ['拉萨', '成都', '川航', '李健', '重庆', '四川', '双流机场', '民航局', '安全带', '视觉中国', 'advan', '空姐', '人民', '窒息', '实习生', '轮胎', '西藏', '英国', '北京'], ['川航', '双流机场', '四川', '成都', '重庆', '萨利机长', '民航飞机', '空中客车', '拉萨', '齐心', '奇迹', '总经理', '法国'], ['共享单车', '枪支暴力', '视觉中国', '芝加哥', '美国'], ['滴滴', '来一', '战狼', '顺风车'], ['巧克力', '夺路而逃', '校外培训机构', '工商总局', '避孕', '幼儿园', '南京'], ['日本', '阿拉丁', '草莓', '人民'], ['微信', '投资', '投资者', '股票', '骗子', '慈善', '网络诈骗', '支付通', '期货', '景德镇', '深圳', '嫌疑人', '股市', '港股', '沈阳', '江西', '第三方支付', '市公安局', '台电', '资本市场', '金立', '90后', '益阳市', '诈骗罪', '珠海', '湖南省', '理财产品', '投资人', '理财', '亏损', '收益率', '广东', '收盘', '黄金'], ['莫焕晶', '吴鹏', '浙江', '人民', '恶魔', '审判', '杭州', '北京', '上海'], ['奚梦瑶', '写真'], ['比特币', '半导体', '虚拟货币', '比特大陆', '招股书', 'avalon', '专利', '雪球', '净利润', '英伟达', '智能家居', 'gpu', 'arm', 'amd', 'win', '台积电', '加密货币', '智能城市', '物联网', '向能', '盈利', '港交所', '人工智能', '小米', '寒武纪', '普通人', '流产', '知识产权', '三星', '投资', '宁波', '创始人', '基础设施', '杭州', '股票', '北京'], ['蔡徐坤', '偶像练习生', '娱乐圈', '选秀节目', '范丞丞', 'tfboys', '奔跑吧', '快乐大本营', '范冰冰', '优胜'], ['徒步旅行', '澳大利亚', 'instagram', '行者'], ['环球时报', '土耳其', '阿根廷', '金融市场', '汇率', '外资公司', '美元指数', '实体经济', '人民', '货币贬值', '华尔街日报', '路透社', '美国', '面包', '印度尼西亚', '泰国', '巴西', '收盘价'], ['琼瑶', '秦汉', '导演', '三人行', '女人四十', '世界尽头', '小脑萎缩', '医生', '台湾'], ['文莱', '马来西亚', '克里', '苏丹', '人民'], ['勃起功能障碍', '涨停', '中国人', '资本市场', '国信证券', '股票', '深圳证券交易所', '收盘价', '收盘', '股东'], ['义乌', '派出所', '陌陌', '微信', '丰田', '湖北'], ['oppo', 'iphone x', '5g', '国产手机', '指纹识别', 'animoji', 'android', '移动支付', '人脸识别', 'ar', '刘海', '传感器', '渲染图', '异形全面屏', 'iphone', '异形屏', '前置摄像头', '霍比特人', '本尼迪克特·康伯巴奇', '全面屏', 'ios', 'apple pay', '小游戏', 'zone', 'ai', 'kinect', 'riva', '智能手机', '演员'], ['假离婚', '党员干部', '含山', '南通', '二胎', '房产', '假结婚', '举报', '巫山县', '招商局', '纪委', '巡视组', '国家利益', '警告处分', '中国特色社会主义', '社会主义核心价值观', '民政部', '哺乳期', '省纪委', '受贿罪', '步步', '安徽省', '安徽', '中国共产党', '重庆', '社会主义'], ['90后', '95后', 'ceo', '王凯', '创始人', '快看漫画', '有妖气', '刻刻', '奇才', '腾讯'], ['个人信息', '荆州', '顺丰', '快递公司', '嫌疑人', '快递员', '市公安局', '河北', '微信', '微信公众号', 'qq邮箱', '定州', '石家庄', '违法行为', '派出所', '湖北省', '审判', '内蒙古', '湖北'], ['短视频', 'iphone 6', '绝地求生', '淘宝', '三星', 'iphone', '贾跃亭', '联想控股', '联想', '柳传志', '董事长', 'ceo', '的联名', '短视频mcn', '淘宝论坛', '三星s9', 'steam', '大逃杀', '杨元庆', '腾讯', '创始人', '总裁'], ['滴滴', '顺风车', '报警', '失踪', '成都', '赛欧', '邛崃市', '雪佛兰', '公安局', '四川'], ['自动驾驶', '马萨', '罗马', 'ds', '捷豹', 'ai', '林志颖', '自动驾驶系统', '香港', '汉密尔顿', '法拉利', '大奖赛', '保时捷', '无人驾驶', '挑战者', '人工智能', '普通人', '奥迪', '传感器', '美国', '奔驰'], ['高发', '嘉兴', '幼儿园', '传染病', '医生', '浙江'], ['性侵', '恋童癖', '弗赖堡', '德国', '强奸', '嫌疑人', '人民'], ['光圈', '三星', '三星galaxy', '安卓8.0', '背景虚化', '语音助手', '异形屏', '曲面屏', '京东', '分辨率', '刘海', '北京'], ['联想', 'linux', '观察者网', '供应商', '宏碁', 'thinkpad', 'deepin', 'ubuntu', '华硕', '戴尔', '惠普', '总经理'], ['5g', '小米', 'galaxy', '三星', '滴滴', '亏损', 'zaker', '英雄联盟', 'rng', '美团', '总冠军', '韩国', '卫星', 'exynos', 'msi', '中国战队', '第一岛链', 'iphone x', '曲面屏', '高通骁龙', 'htc', '骁龙 845', '6g', '长焦', '等着我', '高通', '广角', '康宁', '人民', '世界冠军', '京东', '蓝宝石', '北京', '分辨率', '方正', '皇族', '空白', '印度洋', '巴黎', '法国'], ['炉石传说', '着魔', '污染', '战斗'], ['成都', '嫌疑人', '绵阳市', '抢劫', '奥迪', '报警'], ['新闻晨报', '过年', '四川'], ['网红', '新浪', '北京'], ['罗永浩', '朋友圈', '区块链', '鸟巢', '玫瑰花', '百度', '改革开放'], ['市公安局', '河池', '派出所', '举报', '河南', '人民'], ['钟楚曦', 'armani', '万万没想到'], ['医生', '南宁', '南宁市', '快手', '尖锐湿疣', '举报'], ['暴走漫画', '耿直', '叶挺', '新浪微博', '知乎', '联合创始人', 'ceo', '朝阳区', '北京'], ['抖音', '今日头条', '马化腾', '微信', '短视频', '张一鸣', '腾讯', '央视'], ['嫌疑人', '微信', '行政拘留', '派出所'], ['性骚扰', '摩根·弗里曼'], ['血虚', '梁家辉', '区块链', '虚拟货币', '江门', '骗子', '嫌疑人', '洋垃圾', '集资诈骗', 'p2p平台', '皮肤瘙痒', '社交平台', '强对流天气', '深圳', '梅州', '马尔代夫', '摄影师', '脱发', '风湿', '粤东', '小雪', '追捕', '三亚', '产后', '南极', '头痛', '公安局', '演员', '杭州', '英国', '美国'], ['婚姻登记处', '广西', '湖南', '万万没想到', '大团圆', '方大', '广东'], ['哈尔滨'], ['微信', '微信支付', '指纹解锁', '案发现场', '人民', '长沙市', '检察院', '信用卡', '长沙'], ['特殊的一天', '火锅'], ['朋友圈', '微信', '纪委', '哈尔滨'], ['滴滴', '用户体验', '网约车', 'ceo', '职场', '诸葛亮', '滴滴出行', '力多', '融资'], ['南海校区', '身亡', '化妆品', '广东'], ['房产', '张宁', '李平', '基金', '淋巴癌', '婚姻登记处', '西方社会', '南京', '相亲', '遗产', '投资'], ['性侵', '性骚扰', '肖申克的救赎', '好莱坞', '海耶斯', '七宗罪', '金基德', '吕克·贝松', '美国丽人', '阿甘正传', '性丑闻', '摩根·弗里曼', '尼克尔森', '惊天魔盗团', '超体', '罗曼·波兰斯基', '恋童癖', '娜塔莉·波特曼', '这个杀手不太冷', '玛丽莲·梦露', '小鲜肉', '爱乐之城', '小金人', '出租车司机', '社交网络', '当幸福来敲门', '美丽心灵', '舞台剧', '摇钱树', '奶酪', '种族歧视', '弗兰克', '教父', '詹姆斯', '娱乐圈', '身亡', '美国', '实习生', '导演', '演员', '资本主义', '黄金'], ['陌陌', '人民', '美国通用', '净利润', '探探', '社交平台', '华尔街', '美国', '盈利'], ['崔永元', '范冰冰', '刘震云', '冯小刚', '张靓颖', '维权'], ['张根硕', '娱乐圈', '黄真伊', '原来是美男', '巴神', '贾玲', '美男子', '贝多芬', '澳门', '报警'], ['南宁', '地铁', '动物园'], ['霍姆斯', '贾跃亭', '新加坡', '乔布斯', '拉里·埃里森', '罗永浩', '斯坦福', '克林顿', '马云', '伊丽莎白', '甲骨文', '胆固醇', '癌症', '医疗机构', '美国', '专利', '传奇', '创始人', '医生', '上市公司', '股票', '投资'], ['贾跃亭', '广州', 'ff91', '王志刚', '土地使用权', 'faraday future', '智能汽车', '战略投资', '乐视网', '乐视', '法定代表人', 'smart', '微信公众号', '新浪财经', '香港', '北京', '制造业', '股东', '上海', '投资'], ['moto', 'android', '摩托罗拉', '指纹识别', 'it之家', '刘海全面屏', '刘海屏', '全面屏', 'moto z3', 'play', '刘海', '美国'], ['黑名单', '共享单车', '网约车', '东莞', '哈罗单车', '滴滴', '武汉', '顺风车', '摩拜', 'ofo', '魏东', '个人信息', '总裁'], ['homepod', 'ios 11.4', 'siri', 'icloud', 'ipad', 'iphone', '音乐', 'apple tv', 'ai', 'wwdc', 'ios 11.3', 'mac', 'google', '智能家居', '新都', 'ios 12', '何音', 'ios', 'music', 'apple watch', 'apple id', 'safari', 'gmail', 'carplay', '方正', '先锋'], ['小米', '小米手环3'], ['区块链', 'vivo', '微信', 'qq', '魅蓝', '小米', '骁龙 845', '骁龙', '荣耀', '朋友圈', '刘强东', 'vulcan', 'vivo apex', '全面屏手机', '全面屏', 'zaker', '安全漏洞', '高通', '越狱', '京东', '安全隐患', '北京', '腾讯', '隐私', '深圳', '房地产', '投资'], ['生态环境', '公安局', '嫌疑人', '禁渔期', '微信', '人民', '统筹', '举报', '地震']]
    all_tags = []
    for t in tags:
        for tag in t:
            all_tags.append(tag)
    params = {
        'data': all_tags,
        # 'data': tags,
        # 'withWeight': True,
        'zk_redis': zk_redis
    }
    # zk_common.p(all_tags)
    ret, prob, c_prob, weight_word = nbs.predict(**params)
    weight_word = np.array([w[ret] for w in weight_word])
    weight_word = weight_word / sum(weight_word)
    weight_word = list(zip(all_tags, weight_word))
    # zk_common.p(ret, 0)
    # zk_common.p(prob, 0)
    # zk_common.p(c_prob, 0)
    # zk_common.p(weight_word)

    data = {}
    withWeight = False
    data["new_app_id"] = None
    data["cat"] = ZK_LABLES[int(ret)]
    data["cat_name"] = ZK_LABLES_NAME[int(ret)]
    data["prob"] = prob
    
    data["keywords"] = " ".join(all_tags)
    data["keywords_weight"] = sorted(weight_word, key=lambda x: float(x[1]), reverse=True)
    data["all_cat"] = sorted([(ZK_LABLES_NAME[c], round(p, 3)) for c, p in c_prob], key=lambda x: x[1], reverse=True)
    zk_common.p(data)

# 模型训练
if args.train:
    # python3 train.py -t
    params = {
        'dirname': ZK_ARTICLES['KW_PATH'], 
        'increment_dirs': None, 
        'cat_id': None, 
        'doc2bow': False, 
        'dictionary': None,
        'with_cat_id': True
    }
    # zk_common.p(params, 0)
    news_corpus  = zk_my_corpus(**params)
    nbs = zk_naive_bayes()
    word_count, doc_count = nbs.train(news_corpus)

    params = {
        'save_path': model_path, 
        'word_count': word_count, 
        'doc_count': doc_count
    }
    nbs.save(**params)


# 模型数据存储到redis
if args.model2redis:
    nbs = zk_naive_bayes()
    doc_count, def_dict = nbs.load(model_path)
    # zk_common.p(def_dict, 0)
    # zk_common.p(doc_count)

    if len(def_dict) > 0:
        params = {'host':'192.168.101.5', 'port': 6379}
        i = 0
        for word in def_dict:
            if i == 0 or i % 100 ==0:
                r = redis.Redis(**params)
                zk_common.p('new redis:' + str(i), 0)
                zk_common.p('-'*50, 0)

            redis_key = 'nbskw_' + hashlib.md5(word.lower().encode(encoding='UTF-8')).hexdigest()

            data = str(def_dict[word])
            r.set(redis_key, data, 86400*7)

            zk_common.p(redis_key, 0)
            zk_common.p(data, 0)
            zk_common.p('='*50, 0)
            i = i+1

        r = redis.Redis(**params)
        r.set('nbskw_doc_count', str(doc_count), 86400*7)
        zk_common.p('nbskw_doc_count', 0)
        zk_common.p(doc_count, 0)

    zk_common.p('='*50, 0)
    zk_common.p('[FINISH]')
